var TestJsonCode = "{\n" +
    "\"code\":200,\n" +
    "\"msg\":\"success\",\n" +
    "\"newslist\":[\n" +
    "{\n" +
    "\"status\":4,\n" +
    "\"updatetime\":\"2019-11-11 16:51:12\",\n" +
    "\"kuaidiname\":\"中国邮政快递/包裹/挂号信/小包\",\n" +
    "\"telephone\":\"11185\",\n" +
    "\"list\":[\n" +
    "{\n" +
    "\"time\":\"2019-11-01 16:17:46\",\n" +
    "\"content\":\"已签收,其他：快递柜,投递员:樊明亮,电话:15509331995\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 15:27:46\",\n" +
    "\"content\":\"【嘉定安亭揽投部】安排投递,投递员:樊明亮,电话:15509331995\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 13:20:43\",\n" +
    "\"content\":\"到达【嘉定安亭揽投部】\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 12:12:08\",\n" +
    "\"content\":\"离开【上海市徐德路处理中心】，下一站【嘉定安亭揽投部】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 08:39:07\",\n" +
    "\"content\":\"到达【无锡集散】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 08:05:19\",\n" +
    "\"content\":\"上海市徐德路处理中心机构代收入库\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 06:00:18\",\n" +
    "\"content\":\"离开【无锡集散】，下一站【上海市徐德路处理中心】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 03:18:52\",\n" +
    "\"content\":\"到达【无锡集散】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-11-01 00:09:15\",\n" +
    "\"content\":\"离开【合肥中心】，下一站【无锡集散】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-10-31 23:35:35\",\n" +
    "\"content\":\"到达【无锡集散】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-10-31 18:30:15\",\n" +
    "\"content\":\"离开【合肥中心】，下一站【无锡集散】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-10-30 19:54:25\",\n" +
    "\"content\":\"到达【合肥中心】（经转）\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-10-30 19:52:15\",\n" +
    "\"content\":\"离开【肥西快包】，下一站【合肥中心】\"\n" +
    "},\n" +
    "{\n" +
    "\"time\":\"2019-10-30 19:50:59\",\n" +
    "\"content\":\"【肥西快包】已收件,揽投员:徐洁\"\n" +
    "}\n" +
    "]\n" +
    "\n" +
    "}\n" +
    "]\n" +
    "}"

// http://www.kuaidi100.com/query?type=快递公司标识码&postid=运单号

// $("#submit").click(function () {
//     var gs = $('#kuaiDiGongSi option:selected').val();
//     var dh = $('#kuaiDiDanHao').text();
//
//     $.ajax({
//         type: "get",
//         url: "http://www.kuaidi100.com/query?",
//         data: "type=" + gs + "&postid=" + dh,
//         success: function (data, state) {
//
//         },
//         error: function (error) {
//             alert("查询出错,请检查个参数是否正确")
//         }
//     })
// })



